app/controllers/items_controller.rb

SELECT  "items".* FROM "items" WHERE "items"."available" = $1 LIMIT 100  [["available", "t"]]
SELECT  "tags".* FROM "tags" LIMIT 100
---
  def index
    @presenter = ItemsIndexPresenter.new(Item.available.limit(100), Tag.limit(100))